In [1]:
import pandas as pd

In [3]:
COST_df = pd.read_csv('COST.csv')

In [4]:
COST_df.head()

,Date,Open,High,Low,Close,Adj Close,Volume
0,2010-01-01,59.130001,60.439999,56.750000,57.430000,44.383762,61205800
1,2010-02-01,57.799999,61.520000,57.360001,60.970001,47.119598,72957800
2,2010-03-01,61.000000,62.119999,59.639999,59.709999,46.287605,78643100
3,2010-04-01,59.730000,61.959999,58.610001,59.080002,45.799232,83104700
4,2010-05-01,59.029999,60.830002,55.000000,58.250000,45.155804,118287900

In [6]:
COST_df = COST_df.rename(columns = {'Adj Close': 'COST'})
COST_df.head()

,Date,Open,High,Low,Close,COST,Volume
0,2010-01-01,59.130001,60.439999,56.750000,57.430000,44.383762,61205800
1,2010-02-01,57.799999,61.520000,57.360001,60.970001,47.119598,72957800
2,2010-03-01,61.000000,62.119999,59.639999,59.709999,46.287605,78643100
3,2010-04-01,59.730000,61.959999,58.610001,59.080002,45.799232,83104700
4,2010-05-01,59.029999,60.830002,55.000000,58.250000,45.155804,118287900

In [7]:
COST_clean = COST_df[['Date','COST']]
COST_clean.head()

         Date       COST
0  2010-01-01  44.383762
1  2010-02-01  47.119598
2  2010-03-01  46.287605
3  2010-04-01  45.799232
4  2010-05-01  45.155804

In [8]:
len(COST_clean)

120

In [9]:
len(COST_clean.dropna())

120